# -*- coding:utf-8 -*-
#   任意输入一个数
#     分三步做如下事情:
#       1) 判断这个数得否大于100 打印结果
#       2) 判断这个数是否小于0 打印结果
#       3) 判断这个数是否在 50 ~ 150之间,打印结果
x = float(input("请输入一个数: "))
# 1) 判断这个数是否大于100 打印结果
if x > 100:
    print(x, '是大于100')
else:
    print(x, '不大于100')

# 2) 判断这个数是否小于0 打印结果
if x < 0:
    print(x, "是小于零")
else:
    print(x, "不小于零")

# 3) 判断这个数是否在 50 ~ 150之间,打印结果
if 50 <= x <= 150:
    print(x, '在50~150之间')
else:
    print(x, '不在50~150之间')
------------------------------------------------------------
2. 输入一年中的月份 1~12 输出这个月在哪儿个季度.如果
     输入其它的数,提示用户"您输错了"

month = int(input("请输入月份(1~12): "))
if 1 <= month <= 3:
    print("春季")
elif 4 <= month <= 6:
    print("夏季")
elif 7 <= month <= 9:
    print("秋季")
elif 10 <= month <= 12:
    print("冬季")
else:
    print("您的输入有错!")
----------------------------------------------------------
if多分支循环：
输入一个数字,用程序来判断这个数是正数,负数还是零
num = int(input("请输入整数: "))
if num > 0:
    print(num, '是正数')
elif num < 0:
    print(num, '是负数')
else:
    print(num, '是零')
-------------------------------------------------------------
if语句嵌套示例：
输入学生的成绩，判断所属的等级。
    score = input("请输入学生成绩")
    score = int(score)
    if 0 <= score <= 100:
        if score < 60:
            print("成绩不及格")
        elif score < 80:
            print("成绩及格")
        elif score < 90:
            print("成绩良好")
        else:
            print("成绩优秀")
    else:
        print("成绩不合法")
-------------------------------------------------------------------
条件表达式的示例：
	商场促销，满100 减 20
money = int(input("请输入商品总金额:"))
pay = money - 20 if money >= 100 else money
print("您需要支付:", pay, "元")
-------------------------------------------------------------------
#    1. 写一个程序.输入一个数,用if语句计算这个数的绝对值并
#       打印出来
n = float(input("请输入一个数: "))
if n < 0:
    n = -n
print("绝对值是:", n)
------------------------------------------------------------------
#    2. 写一个程序.输入一个数,用条件表达式计算这个数的绝对
#       值并打印出来
#      (要求: 不允许用 abs(x) 函数)
n = float(input("请输入一个数: "))
n = n if n > 0 else -n  # 表达式
print('的绝对值是:', n)
------------------------------------------------------------------
 pass示例
    score = int(input("请输入学生成绩:"))
    if 0 <= score <= 100:
        pass
    else:
        print("不合法的成绩")
--------------------------------------------------------------------
#### 改为 如下方式将会有语法错误
    score = int(input("请输入学生成绩"))
    if 0 <= score <= 100:
    else:
        print("不合法的成绩")
--------------------------------------------------------------------
三引号示例：
   print('welcome to beijing.\nI like python!\nI am studing.')
    
    print("""welcome to beijing.
    I like python!
    I am studing.""")
-------------------------------------------------------------------
raw字符串示例
      a = 'C:\newfile\test.py'
      print(a)
      len(a)
    
      a = r'C:\newfile\test.py'
      print(a)
      len(a)
-------------------------------------------------------------------
练习：
写一个程序， 打印一个高度为4行的矩形方框
要求输入一个整形数字，此整数代表矩形的宽度，输出此矩形:
	如：
  	请输入矩形宽度: 10
  	##########
  	#        #
  	#        #
  	##########
  	w = int(input('请输入宽度：'))
  	line1 = '#'*w
    line2 = '#'+(w-2)*" "+'#'
    print(line1)
    print(line2)
    print(line2)
    print(line1)
-------------------------------------------------------------------
练习：
        写程序，输入一个长长的字符串，判断你的姓名是否在这个字符串中。
        如果存在，则打印： "你的名字出现了"
        否则不予理睬
   s = input('请输入一段字符串：')
   if 'zhangsan' in s:
       print('找到你啦')
   else:
      print('没找到')
-------------------------------------------------------------------
练习：
        输入一个字符符串，打印如下内容:
        1. 打印这个字符串的第一个字符
        2. 打印这个字符串的最后一个字符
        3. 如果这个字符串的长度是奇数，打印中间这个字符
        注：
           求字符串长度的函数是len(s)
	s = input("请输入字符串: ")
	print("第一个字符是:", s[0])
	print("最后一个字符是:", s[-1])
	if len(s) % 2 == 1:   # if len(s) % 2:
    # center = int((len(s) -1 ) / 2)
    # print(s[center])
    	print('中间这个字符是:', s[len(s) // 2])
-------------------------------------------------------------------
切片练习：
1. 写一个程序，输入一个字符串，把字符串的第一个字符和最后一个字符去掉后，
打印出处理后的字符串
    a = input('请输入一个字符串：')
    result = a[1:-1]
    print('输入的结果是：',a)
    print('处理后的结果是：',result)
-------------------------------------------------------------------
2. 输入任意一个字符串，判断这个字符串是否是回文
    回文示例:
      上海自来水来自海上
      ABCCBA
      14841
      367763
      abccba
     回文是指中心对称的文字
     随意输入一段文字，判断是否为回文
    text = input('请输入字符串：')
    result = text[::-1]
    if text == result:
    	print(text,'是回文')
    else:
    	print(text,'不是回文')
--------------------------------------------------------------------
字符串的编码转换函数
1. 写一个程序，输入一段字符串，如果字符串不为空，则把第一个字符的编码打印出来
s = input('请输入一段字符串：')
if s != '':
	print('第一个字符的编码是：',ord(s[0]))
else:
	print('输入为空')
---------------------------------------------------------------------
2. 写一个程序，输入一个整数值(0-65535),打印出这个数值所对应的字符
n = input('请输入一个整数：（0-65535）')
print('对应的值为：',n)
--------------------------------------------------------------------
字符串的构造函数：
  1. 用字符串 * 运算符打印三角形
    输入一个整数,此整数代表此三角形左侧预留的字符数
      当数字越大时,此三角形越靠右
         *
        ***
       *****
      *******
n = int(input("请输入左侧空格个数: "))
print(' ' * n + "   *")
print(' ' * n + "  ***")
print(' ' * n + " *****")
print(' ' * n + "*******")
-------------------------------------------------------------------
#   3. 输入三行文字,让这三行文字在一个方框内居中显示
#     如输入(不要输入中文):
#       hello!
#       I'm studing python!
#       I like python!
#       +---------------------+
#       |        hello!       |
#       | I'm studing python! |
#       |   I like python!    |
#       +---------------------+
s1 = input("请输入第1行: ")
s2 = input("请输入第2行: ")
s3 = input("请输入第3行: ")
max_length = max(len(s1), len(s2), len(s3))
first_line = '+-' + '-' * max_length + '-+'
print(first_line)
# 打印第 2, 3, 4行
print('| ' + s1.center(max_length) + ' |')
print('| ' + s2.center(max_length) + ' |')
print('| ' + s3.center(max_length) + ' |')
# 打印最后一行
print(first_line)
-------------------------------------------------------------
练习：
输入一个字符串:
   1. 判断您输入的字符串有几个空格:
   2. 将原字符串的左右空白字符去掉，打印出有效的字符串的个数
   3. 判断您输入的是否是数字
s = input('请输入字符串：')

print('您输入的字符串有',s.count(' '),'个空格')
s2 = s.strip()
print('有效字符的个数是：'，len(s2))
if s2.isdigit():
	print('您输入的是数字')
else:
	print('您输入的不是数字')
--------------------------------------------------------------
字符串的表示方法：
'%10d'%123    '       123'
'%-10d'%123   '123       '
'%10s'%'abc'  '       abc'
'%-5%s'%'abc' 'abc  '
'%05d'%123    '00123'
'%07.3f'%3.1415  003.141
-------------------------------------------------------------
#   输入三行文字,让这三行文字依次以 20个字符的宽度右对齐
#   输出
#     如:
#       请输入第1行: hello world!
#       请输入第2行: abcd
#       请输入第3行: a
#     输出结果为:
#                hello world!
#                        abcd
#                           a
#   做完上面的题后再思考:
#     能否以最长字符串的长度进行右对齐显示(左侧填充空格)
s1 = input("请输入第1行: ")
s2 = input("请输入第2行: ")
s3 = input("请输入第3行: ")

print("%20s" % s1)
print("%20s" % s2)
print("%20s" % s3)
---------------------------------------------------------------
以最长的字符串进行填充空格
m = max(len(s1),len(s2),len(s3))
print('最大长度',m)
print(' '*(m-len(s1))+s1)
print(' '*(m-len(s2))+s2)
print(' '*(m-len(s3))+s3)
----------------------------------------------------------------
方式三
fmt =   '%%%ds'% m
print(fmt%s1)
print(fmt%s2)
print(fmt%s3)
-----------------------------------------------------------------
while 语句的示例：
i = 1
while i <=20:
	print('hello world')
	i += 1
else:
	print('循环结束')
print('[process over!]')
----------------------------------------------------------------
输入一个数字用n绑定，打印出n行的'hello world'.
s = int(input('请输入一个数字：'))
i = 1
while i <= s:
	print('hello world')
	i += 1
else:
	print('循环结束')
print('[process over!]')
----------------------------------------------------------------
用while打印出1-20之间的整数，包含20
i = 1
while i <= 20:
	print(i)
	i+=1
print('[process over!]')
---------------------------------------------------------------总结
输入一个整数，用end绑定，打印出1-end之间的所有整数
end = int(input('请输入一个结束整数：'))
i = 1
while i <= end:
	print(i)
	i+=1
----------------------------------------------------------------
# 2. 打印 1 ~ 20的整数,打印在一行内
#     提示:
#        print(i, end=' ')

i = 1
while i <= 20:
    print(i, end=' ')
    i += 1
else:
    print()  # 换行 print(end='\n')
----------------------------------------------------------------
#   2. 写一个程序
#     输入一个开始的整数 用变量begin绑定
#     输入一个结束的整数用变量end绑定
#     打印 从 begin 到 end(不包含end) 的每个整数,在印在
#     一行内
#       如:
#         请输入开始值: 8
#         请输入结束值: 20
#       打印:
#         8 9 10 11 12 13 .... 19
#     思考,如何实现每5个数字打印在一行内,打印多行
#       提示: 多加一个变量来记录打印的个数
begin = int(input("请输入开始值: "))
end = int(input("请输入结束值: "))
while begin < end:
    print(begin, end=' ')
    # 当上述循环完成时
    begin += 1
print()  # 换行
------------------------------------------------------------------
   3. 打印1 ~ 20的整数,每行打印5个,打印4行
#      1 2 3 4 5
#      6 7 8 9 10
#      11 12 ...
#      ....
i = 1
while i <= 20:
    print(i, end=' ')
    if i % 5 == 0:
        print()  # 换行
    i += 1
------------------------------------------------------------------
#   3. 写程序 求:
#        1 + 2 + 3 + 4 + ..... + 99 + 100
#       的和,并打印结果:
#          5050
#       提示:
#         用一个变量初始值为0来累加结果
i = 1
    s = 0   # 创建一个变量用不准备累加数据
while i <= 100:
    s += i  # 将此时的i值累加到s中
    i += 1
# 当while结束,此时的s的值为 1 + 2 ... + 99 + 100
print("1+2+3+.....+99+100=", s)
------------------------------------------------------------------
while 循环嵌套的示例：
j = 1
while j <=10:
	i = 1
	while i <=20:
		print(i,end=' ')
		i+=1
	else:
		print()
	j+=1
------------------------------------------------------------------
break示例：
i = 1
while i <= 6:
    print("循环开始: ", i)
    if i == 3:
        break
    print("循环结束:", i)
    i += 1
else:
    print("while里的else子句被执行!")

print("程序结束")
----------------------------------------------------------------

